clc;
clear all

%
%A = [70 1 0 0 0 0; 1 90 -1 0 0 0; 0 -1 110 1 0 0; 0 0  1 -120 1 0; 0 0 0 1 135 -1; 0 0 0 0 -1 150];
a = [0 1 1 1 -1 2]; %Поддиагональ
b = [70 90 110 -120 135 150]; %Основная диагональ
c = [1 -1 1 1 -1]; %Наддиагональ
d = [7; 10; 10; -13; 14; 16]; %Матрица ответов
X = zeros(length(d), 1); %Матрица - заготовка под ответы
n = length(b);

%Прямая прогонка
for i = 2:n
    
    k = a(i)/b(i-1);
    b(i) = b(i) - k*c(i-1);
    d(i) = d(i) - k*d(i-1);
    
end

%Обратная прогонка

X(n) = d(n)/b(n);

for i = n-1:-1:1
   
    X(i) = (d(i)-c(i)*X(i+1))/b(i);
    
end

for i = 1:length(X)
    
    fprintf('\nx%d = %f\n', i, X(i));
    
end